from django.conf import settings


def menu(request):
    return {
        'logo': [
            '1100100011001100101',
            '1010110010101010111',
            '1110011010101110010',
            '0000000000000000000',
            '0000110020200100000',
            '0000101000001110000',
            '0000101010100100000',
            '0000000000000000000',
            '0011001000011011000',
            '0010101100101010100',
            '00111001101110111000'
        ],
        'slim_logo': [
            '11001000110011001010110020200100110010000110110',
            '10101100101010101110101000001110101011001010101',
            '11100110101011100100101010100100111001101110111',
        ],
        'slim_logo_mini': [
            '202',
            '000',
            '101',
        ],
        'sidemenu': (
            ('Главная', '/', 'power'),
            ('Новости', '/news/', 'newspaper'),
            ('Музыка', '/music/', 'play'),
            ('О проекте', '/about/', 'user circle outline'),
            # ('Поиск', '/search/', 'search'),
        ),
        'menu': (
            ('Новости', '/news/'),
            ('Музыка', '/music/'),
            ('О проекте', '/about/'),
        ),
        'website_url': settings.WEBSITE_URL,
    }
